ebowwa/MentraOS/mcu_client/nrf5340_ble_simulator/src/main.c
		if (buttons & KEY_PASSKEY_REJECT) {
			num_comp_reply(false);
		}
		return; // Don't handle other buttons during authentication
	}
#endif /* CONFIG_BT_NUS_SECURITY_ENABLED */

	// **NEW: Button combination for pattern cycling (Button 1 + Button 2)**
	if ((button_state & KEY_PATTERN_CYCLE) == KEY_PATTERN_CYCLE && 
	    (has_changed & (DK_BTN1_MSK | DK_BTN2_MSK))) {
		LOG_INF("🎨 Button combo 1+2: Cycling LVGL test patterns");
		display_cycle_pattern();
		return; // Don't process individual button presses when combination is active
	}

	// **NEW: Button 1 alone - Cycle battery level 0→100% and toggle charging**
	if (buttons & KEY_BATTERY_CYCLE && !(button_state & DK_BTN2_MSK)) {
		static uint8_t battery_level = 0;
		static bool charging_state = false;
		
		// Cycle battery: 0→20→40→60→80→100→0...
		battery_level += 20;
		if (battery_level > 100) {
			battery_level = 0;
		}
		
		// Toggle charging state each cycle
		charging_state = !charging_state;
		
		protobuf_set_battery_level(battery_level);
		protobuf_set_charging_state(charging_state);
		
		LOG_INF("🔋 Button 1: Battery %u%%, charging: %s", 
		        battery_level, charging_state ? "ON" : "OFF");
		return;
	}

	// **NEW: Button 2 alone - Cycle through LVGL test patterns**
	if (buttons & KEY_SCREEN_TOGGLE && !(button_state & DK_BTN1_MSK)) {
		LOG_INF("🎨 Button 2: Cycling LVGL test patterns");
		display_cycle_pattern();
		return;
	}

	// **DISABLED: Buttons 3 & 4 are ignored due to SPI4 conflicts**
	if (has_changed & (DK_BTN3_MSK | DK_BTN4_MSK)) {
		// LOG_WRN("⚠️  Buttons 3/4 disabled (SPI4 conflict on P0.08/P0.09)");
	}
}

static void configure_gpio(void)
{
	int err;

	// Always initialize buttons for battery level control
	err = dk_buttons_init(button_changed);
	if (err) {
		LOG_ERR("Cannot init buttons (err: %d)", err);
	}

	err = dk_leds_init();
	if (err) {
		LOG_ERR("Cannot init LEDs (err: %d)", err);
	}
}

int main(void)
{
	int blink_status = 0;
	int err = 0;

	LOG_INF("🚀🚀🚀 MAIN FUNCTION STARTED - v2.2.0-DISPLAY_OPEN_FIX 🚀🚀🚀");
	printk("🌟🌟🌟 MAIN FUNCTION PRINTK - v2.2.0-DISPLAY_OPEN_FIX 🌟🌟🌟\n");

	configure_gpio();

	// **NEW: Log updated button functionality (avoiding SPI4 conflicts)**
	LOG_INF("� Button controls updated (avoiding SPI4 pin conflicts):");
	LOG_INF("   � Button 1: Cycle battery 0→100%% + toggle charging");
	LOG_INF("   🎨 Button 2: Cycle LVGL test patterns");
	LOG_INF("   🎨 Button 1+2: Cycle LVGL test patterns (same as Button 2)");
	LOG_INF("   ⚠️  Buttons 3&4 disabled (SPI4 conflict P0.08/P0.09)");
	LOG_INF("   � Current battery level: %u%%", protobuf_get_battery_level());

	// Initialize brightness control
	LOG_INF("💡 LED 3 brightness control enabled:");
	LOG_INF("   📱 Mobile app can set brightness level (0-100%%)");
	LOG_INF("   📊 Current brightness level: %u%%", protobuf_get_brightness_level());
	
	// Set initial brightness to 50%
	protobuf_set_brightness_level(50);

	// err = uart_init();
	// if (err) {
	// 	error();
	// }

	if (IS_ENABLED(CONFIG_BT_NUS_SECURITY_ENABLED)) {
		err = bt_conn_auth_cb_register(&conn_auth_callbacks);
		if (err) {
			LOG_ERR("Failed to register authorization callbacks. (err: %d)", err);
			return 0;
		}

		err = bt_conn_auth_info_cb_register(&conn_auth_info_callbacks);
		if (err) {
			LOG_ERR("Failed to register authorization info callbacks. (err: %d)", err);
			return 0;
		}
	}

	err = bt_enable(NULL);
	if (err) {
		error();
	}
	
	LOG_INF("Bluetooth initialized");

	k_sem_give(&ble_init_ok);

	if (IS_ENABLED(CONFIG_SETTINGS)) {
		settings_load();
	}

	err = mentra_ble_init(&mentra_cb);
	if (err) {
		LOG_ERR("Failed to initialize Mentra BLE service (err: %d)", err);
		return 0;
	}
	bt_gatt_cb_register(&gatt_callbacks);
	// Initialize PDM audio streaming system
	LOG_INF("🎤 Initializing PDM audio streaming system...");
	err = pdm_audio_stream_init();
	if (err) {
		LOG_ERR("Failed to initialize PDM audio streaming (err: %d)", err);
		// Continue without audio streaming capability
	} else {
		LOG_INF("✅ PDM audio streaming system ready");
		LOG_INF("📱 Mobile app can enable/disable microphone via MicStateConfig (Tag 20)");
	}

	// Initialize ping/pong connectivity monitoring system
	LOG_INF("📡 Initializing ping/pong connectivity monitoring...");
	protobuf_init_ping_monitoring();
	LOG_INF("✅ Ping monitoring started - glasses will ping phone every 10 seconds");
	LOG_INF("📱 Phone should respond with pong messages to maintain connection");

	// Initialize LVGL display system with working driver implementation
	printk("🔥🔥🔥 About to initialize LVGL display system... 🔥🔥🔥\n");
	
	// Start the LVGL display thread first!
	printk("🧵🧵🧵 Starting LVGL display thread... 🧵🧵🧵\n");
	lvgl_display_thread();
	printk("✅✅✅ LVGL display thread started! ✅✅✅\n");
#if 0
        // Give the thread a moment to initialize
        k_msleep(100);
        
        // Send LCD_CMD_OPEN to start the LVGL display system
        printk("📡📡📡 Calling display_open() NOW... 📡📡📡\n");
        display_open();
        printk("✅✅✅ display_open() call completed! ✅✅✅\n");
        
        // Add direct HLS12VGA test from main thread
        LOG_INF("🖥️ Testing HLS12VGA display from main thread...");
        const struct device *test_disp = DEVICE_DT_GET(DT_CHOSEN(zephyr_display));
        if (device_is_ready(test_disp)) {
            LOG_INF("✅ HLS12VGA device ready in main: %s", test_disp->name);
            
            // Try to turn off blanking
            int ret = display_blanking_off(test_disp);
            LOG_INF("📺 Display blanking off result: %d", ret);
            
            // Try a simple write operation
            uint8_t test_data[8] = {0xFF, 0xFF, 0xFF, 0xFF, 0x00, 0x00, 0x00, 0x00};
            struct display_buffer_descriptor desc = {
                .buf_size = 8,
                .width = 4,
                .height = 1,
                .pitch = 4,
            };
            
            ret = display_write(test_disp, 0, 0, &desc, test_data);
            LOG_INF("🎨 Display write result: %d", ret);
            
            if (ret == 0) {
                LOG_INF("🎉 SUCCESS: HLS12VGA write operation completed!");
            } else {
                LOG_ERR("❌ FAILED: HLS12VGA write operation failed: %d", ret);
            }
        } else {
            LOG_ERR("❌ HLS12VGA device not ready in main");
        }
        
        // The LVGL demo thread is already defined in lvgl_demo.c - no need to call it here
        LOG_INF("LVGL demo thread will start automatically");
#endif
	k_work_init(&adv_work, adv_work_handler);
	advertising_start();

	for (;;) {
		dk_set_led(RUN_STATUS_LED, (++blink_status) % 2);
		k_sleep(K_MSEC(RUN_LED_BLINK_INTERVAL));
	}
}

void ble_write_thread(void)
{
	/* Don't go any further until BLE is initialized */
	k_sem_take(&ble_init_ok, K_FOREVER);
	struct uart_data_t mentra_data = {
		.len = 0,
	};

	for (;;) {
		/* Wait indefinitely for data to be sent over bluetooth */
		struct uart_data_t *buf = k_fifo_get(&fifo_uart_rx_data,
						     K_FOREVER);

		int plen = MIN(sizeof(mentra_data.data) - mentra_data.len, buf->len);
		int loc = 0;

		while (plen > 0) {
			memcpy(&mentra_data.data[mentra_data.len], &buf->data[loc], plen);
			mentra_data.len += plen;
			loc += plen;

			if (mentra_data.len >= sizeof(mentra_data.data) ||
			   (mentra_data.data[mentra_data.len - 1] == '\n') ||
			   (mentra_data.data[mentra_data.len - 1] == '\r')) {
				if (mentra_ble_send(current_conn, mentra_data.data, mentra_data.len)) {
					LOG_WRN("Failed to send data over BLE connection");
				}
				mentra_data.len = 0;
			}

			plen = MIN(sizeof(mentra_data.data), buf->len - loc);
		}

		k_free(buf);
	}
}

K_THREAD_DEFINE(ble_write_thread_id, STACKSIZE, ble_write_thread, NULL, NULL,
		NULL, PRIORITY, 0, 0);
